In [4]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv("data/influencers.csv", index_col='id')
df

,full_text,favorites,retweets,mentions,country,user,followers,followees
id,,,,,,,,
183721,Flying home to run down from the power to comi...,23.0,NaN,10.0,MADRID,adrianramos,389.0,258
183722,Today we commemorate and MNML Case.,500.0,21.0,NaN,ALICANTE,sofiasantos,982.0,1822
183723,Today we have reached US$6.55 Billion TT$44‚Ä¶,190.0,123.0,6.0,ELCHE,dianapardo,12.0,129
183724,Faking It by Joel Atwell. Written by Other cou...,131.0,76.0,3.0,MADRID,luciaserrano,332.0,378
183725,Welcome back! üôå,113.0,130.0,9.0,ELCHE,dianapardo,12.0,129
183726,Contest: Win a fan of his ass. #thatisall Thanks!,492.0,70.0,6.0,ALICANTE,sofiasantos,982.0,1822
183727,80's & friends! ‚úàÔ∏è,158.0,40.0,22.0,MADRID,adrianramos,389.0,258
183728,Thank you guess how did I feel somewhat offend...,NaN,50.0,10.0,ELCHE,dianapardo,12.0,129
183729,OnePlus 8 international giveaway classifies,198.0,82.0,26.0,ELCHE,dianapardo,12.0,129
183730,Here it is.. Retweet this desperate,272.0,92.0,29.0,ALICANTE,sofiasantos,982.0,1822
183731,Great to advertise during the year I tweeted a...,43.0,111.0,8.0,ALICANTE,sofiasantos,982.0,1822
183732,Its been in love with the game with the origin...,349.0,44.0,19.0,ALICANTE,sofiasantos,982.0,1822
183733,Programming is the best!,467.0,69.0,10.0,MADRID,adrianramos,389.0,258
183734,I cannot believe this!,50.0,24.0,22.0,MADRID,adrianramos,389.0,258
183735,Buy this product NOW!!,418.0,24.0,2.0,ELCHE,danicarvajal,21.0,2721
183736,I have one is best color gradients: Just relea...,361.0,92.0,1.0,ELCHE,dianapardo,12.0,129
183737,PIC!!,346.0,115.0,24.0,ALICANTE,cristianoronaldo,82.0,351
183738,hmmm feeling bad today,296.0,93.0,29.0,ELCHE,danicarvajal,21.0,2721
183739,not feeling god right now,315.0,26.0,10.0,MADRID,luciaserrano,332.0,378
183740,Programming is a hot topic!,133.0,145.0,15.0,ALICANTE,cristianoronaldo,82.0,351
183741,Programming? i love it!,92.0,146.0,1.0,MADRID,luciaserrano,332.0,378
183742,WHAT???,255.0,73.0,17.0,MADRID,luciaserrano,332.0,378
183743,Amazing video by Leonardo!,432.0,95.0,18.0,ALICANTE,cristianoronaldo,82.0,351
183744,Thanks man!,430.0,143.0,28.0,ALICANTE,cristianoronaldo,NaN,351
183745,There is nothing better than programming!,424.0,110.0,29.0,ALICANTE,cristianoronaldo,82.0,351
183746,BORED AF,488.0,28.0,27.0,ELCHE,danicarvajal,21.0,2721
183747,I do not know if i like programming or other t...,318.0,58.0,20.0,ALICANTE,antoniamartinez,928.0,9918

In [ ]:
df.describe()

        favorites    retweets   mentions   followers    followees
count   26.000000   26.000000  26.000000   26.000000    27.000000
mean   280.538462   80.000000  15.423077  352.807692  1190.185185
std    153.377242   40.303846   9.596554  375.319493  1965.735995
min     23.000000   21.000000   1.000000   12.000000   129.000000
25%    139.250000   45.500000   8.250000   21.000000   258.000000
50%    305.500000   79.000000  16.000000  332.000000   351.000000
75%    422.500000  110.750000  23.500000  389.000000  1822.000000
max    500.000000  146.000000  29.000000  982.000000  9918.000000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 27 entries, 183721 to 183747
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   full_text  27 non-null     object
 1   favorites  26 non-null     float64
 2   retweets   26 non-null     float64
 3   mentions   26 non-null     float64
 4   country    27 non-null     object
 5   user       27 non-null     object
 6   followers  26 non-null     float64
 7   followees  27 non-null     int64
dtypes: float64(4), int64(1), object(3)
memory usage: 1.9+ KB

Tenemos un tipode filtrado que elimina datos nulos (NaN)

In [10]:
df_filtrado = df.dropna()
df_filtrado.head()

,full_text,favorites,retweets,mentions,country,user,followers,followees
id,,,,,,,,
183723,Today we have reached US$6.55 Billion TT$44‚Ä¶,190.0,123.0,6.0,ELCHE,dianapardo,12.0,129
183724,Faking It by Joel Atwell. Written by Other cou...,131.0,76.0,3.0,MADRID,luciaserrano,332.0,378
183725,Welcome back! üôå,113.0,130.0,9.0,ELCHE,dianapardo,12.0,129
183726,Contest: Win a fan of his ass. #thatisall Thanks!,492.0,70.0,6.0,ALICANTE,sofiasantos,982.0,1822
183727,80's & friends! ‚úàÔ∏è,158.0,40.0,22.0,MADRID,adrianramos,389.0,258

Limpiar el DATAFRAME  poder un valor por defcto a todos los datos NaN

In [13]:
df_filtrado = df.fillna(0)
df_filtrado.head()

,full_text,favorites,retweets,mentions,country,user,followers,followees
id,,,,,,,,
183721,Flying home to run down from the power to comi...,23.0,0.0,10.0,MADRID,adrianramos,389.0,258
183722,Today we commemorate and MNML Case.,500.0,21.0,0.0,ALICANTE,sofiasantos,982.0,1822
183723,Today we have reached US$6.55 Billion TT$44‚Ä¶,190.0,123.0,6.0,ELCHE,dianapardo,12.0,129
183724,Faking It by Joel Atwell. Written by Other cou...,131.0,76.0,3.0,MADRID,luciaserrano,332.0,378
183725,Welcome back! üôå,113.0,130.0,9.0,ELCHE,dianapardo,12.0,129

Pudiera ser que necesitemos indicar valores doferentes para los NaN en difrentes columnas.
Indicar calores NaN distintos dependiendo de la columna

In [15]:
df.filtrado = df.fillna({"retweets":0, "mentions":-1})
df_filtrado.head()

/var/folders/4z/c52zmv8x4ls48rw7nsn3f1gm0000gq/T/ipykernel_3841/1052147878.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.filtrado = df.fillna({"retweets":0, "mentions":-1})

,full_text,favorites,retweets,mentions,country,user,followers,followees
id,,,,,,,,
183721,Flying home to run down from the power to comi...,23.0,0.0,10.0,MADRID,adrianramos,389.0,258
183722,Today we commemorate and MNML Case.,500.0,21.0,0.0,ALICANTE,sofiasantos,982.0,1822
183723,Today we have reached US$6.55 Billion TT$44‚Ä¶,190.0,123.0,6.0,ELCHE,dianapardo,12.0,129
183724,Faking It by Joel Atwell. Written by Other cou...,131.0,76.0,3.0,MADRID,luciaserrano,332.0,378
183725,Welcome back! üôå,113.0,130.0,9.0,ELCHE,dianapardo,12.0,129

Vamos visualizar los tweets mas populares. Queremos mostrar los favoritos mayoes a 400 y que tengan mas de 20 meniones

In [16]:
df[
    (df["favorites"]>400)
    &
    (df["mentions"]>=20)
    ]

,full_text,favorites,retweets,mentions,country,user,followers,followees
id,,,,,,,,
183744,Thanks man!,430.0,143.0,28.0,ALICANTE,cristianoronaldo,NaN,351
183745,There is nothing better than programming!,424.0,110.0,29.0,ALICANTE,cristianoronaldo,82.0,351
183746,BORED AF,488.0,28.0,27.0,ELCHE,danicarvajal,21.0,2721

Podemos buscar dentro de contenido de un texto. Para ello usaremos el m√©todo contains
OJO, es case sensitive!

In [19]:
df[
    df['full_text'].str.contains("programming")
    
]

,full_text,favorites,retweets,mentions,country,user,followers,followees
id,,,,,,,,
183732,Its been in love with the game with the origin...,349.0,44.0,19.0,ALICANTE,sofiasantos,982.0,1822
183745,There is nothing better than programming!,424.0,110.0,29.0,ALICANTE,cristianoronaldo,82.0,351
183747,I do not know if i like programming or other t...,318.0,58.0,20.0,ALICANTE,antoniamartinez,928.0,9918

DATAFRAMES contiene un m√©todo llamado APPLY que nos permite realizar acciones sobre una columna (por ejemplo) fila a fila.
Para poder usarlo se necesita una funci√≥n para calcular los datos con m√°s c√≥digo.

def miFuncion(valores):
    resultado = valores *5 + 2
    return resultado



df['columna'].apply(miFuncion)

In [21]:
def multPorDos(menciones):
    doble = menciones*2
    return doble

#agregamos una nueva columna al df con el doble de menciones

df['doble_mentions']=df['mentions'].apply(multPorDos)
df.head()

,full_text,favorites,retweets,mentions,country,user,followers,followees,doble_mentions
id,,,,,,,,,
183721,Flying home to run down from the power to comi...,23.0,NaN,10.0,MADRID,adrianramos,389.0,258,20.0
183722,Today we commemorate and MNML Case.,500.0,21.0,NaN,ALICANTE,sofiasantos,982.0,1822,NaN
183723,Today we have reached US$6.55 Billion TT$44‚Ä¶,190.0,123.0,6.0,ELCHE,dianapardo,12.0,129,12.0
183724,Faking It by Joel Atwell. Written by Other cou...,131.0,76.0,3.0,MADRID,luciaserrano,332.0,378,6.0
183725,Welcome back! üôå,113.0,130.0,9.0,ELCHE,dianapardo,12.0,129,18.0

Creamos una nueva columna que sea la Popularidad del Influencer.
Popularidad = Seguidores/Seguidos
NO puedo enviar los datos de dos filas, entoces tengo que enviar los datos de todo las filas. Para ello se utiliza axis como parametro dentro de APPLY
axis =1 ---> Significa enviar la fila

In [24]:
def Popularity(fila):
    followers=fila['followers']
    followees=fila['followees']
    popularity= followees/followers
    return popularity

df['Pop']=df.apply(Popularity, axis=1)
df[
    df['Pop']>=100
    
]

,full_text,favorites,retweets,mentions,country,user,followers,followees,doble_mentions,Pop
id,,,,,,,,,,
183735,Buy this product NOW!!,418.0,24.0,2.0,ELCHE,danicarvajal,21.0,2721,4.0,129.571429
183738,hmmm feeling bad today,296.0,93.0,29.0,ELCHE,danicarvajal,21.0,2721,58.0,129.571429
183746,BORED AF,488.0,28.0,27.0,ELCHE,danicarvajal,21.0,2721,54.0,129.571429

Vamos a agrupar por el campo country y vamos mostrar la media de dicho grupo. Como la media debe ser un valor numerico hay que hacer la salvedad de que solo muestre el calculo para colimnas con valores numericos

In [26]:
df.groupby(['country']).mean(numeric_only=True)

,favorites,retweets,mentions,followers,followees,doble_mentions,Pop
country,,,,,,,
ALICANTE,339.909091,91.272727,19.600,616.600,1889.363636,39.20,3.708644
ELCHE,294.857143,77.750000,13.750,15.375,1101.000000,27.50,55.308036
MADRID,186.375000,64.857143,11.875,360.500,318.000000,23.75,0.900897

Imaginemos que necesitamos recuperar la media y la suma de los campos
MEDIA: df.groupby(['columna']).mean()
SUMA: df.groupby(['columna']).mean()

Tenemos una funcion para los grupos que nos permite mostrar mas de un resumen en la misma instruccion llamada agg: agg({"max","min"})
Tambien nos permite incluir que columnas queremos mostrar dentro de agg

In [ ]:
#df.groupby(['country']).agg({"max", "min"})
grupo=df.groupby(['country']).agg({
 "followers":"sum", 
 "mentions":"mean", 
 "retweets":"max",
})

grupo[grupo['followers'] > 5000]

          followers  mentions  retweets
country
ALICANTE     6166.0      19.6     145.0

Para exportar datos:
Vamos a almacenar grupo dentro de un CSV

In [ ]:
grupo.to_csv('data/grupo.csv')
grupo.to_json('data/grupo.json')
grupo.to_html('data/grupo.html')